def 학습데이터처리숙제_3월말까지():
    info = {"전세환", "남", 19950607, }

    hw1(info)
    hw2()
    hw3()
    hw4()
    hw5()


def hw1(info):
    print("""• 정수형, 실수형, 문자열 및 “리스트 내에 리스트” 등을 포함하여 자신을 소개하는 리스트를 만들고,
        리스트 인덱싱과 슬라이싱 기법 등을 이용하여 자기 소개하는 것 표현해보기""")


def hw2():
    print("""• 문자열 변수에서 특정 인덱싱으로 접근 후 문자열을 변경할 수 있는가? 답변 및 가능한 방법
        코드 작성 및 제출, mutable, immutable 자료형 정리해보기.""")


def hw3():
    print("""• List에서 Append, insert, extend 차이점, remove/pop 차이점, 각각 예제 코드 작성 및 설명""")


def hw4():
    print("""• 기존 파싱 코드에서 자료형 list와 문자열 관련 함수 split()을 이용하여 동일한 결과 도출하기""")


def hw5():
    print("""• 기존 파싱 코드에서 데이터를 어떻게 만들면 더욱 효율적으로 처리할 수 있는지
        – Data 형식 변경 및 추가, 코드 작성 결과 확인 (조건은 동일함, 크기가 100보다 크면 vehicle에서 truck으로    """)
